<!DOCTYPE html PUBLIC &quot;-//W3C//DTD HTML 4.01//EN&quot; &quot;http://www.w3.org/TR/html4/strict.dtd&quot;>
<html>
  
  <head>
    <meta content=&quot;text/html; charset=ISO-8859-1&quot; http-equiv=&quot;content-type&quot;>
    <title>Laborat&oacute;rio 12a</title>
  </head>
  
  <body style=&quot;text-align: justify&quot;> 
    
    <em> <b> MC102 - Algoritmos e Programa&ccedil;&atilde;o de Computadores </b> </em> <br>
    <em> <b> Turmas QRSTWY </b> </em> <br>
    <em> <b> Instituto de Computa&ccedil;&atilde;o - Unicamp </b> </em> <br>
    <em> <b> Professores: </b> H&eacute;lio Pedrini e Zanoni Dias </em> <br>
    <em> <b> Monitores: </b> Andre Rodrigues Oliveira, Gustavo Rodrigues Galv&atilde;o, Javier Alvaro Vargas Mu&ntilde;oz e Thierry Pinheiro Moreira</em>

    <br> <br> <hr>
    <h2>Lab 12a - Tweet Extractor</h2>

    <b> <em> Prazo de entrega: </em> </b> 08/06/2015 &agrave;s 13h59m59s <br>
    <b> <em> Peso: </em> </b> 8 <br> <br> <hr> <br>

    <p align=&quot;justify&quot;>
      Linguagem de marca&ccedil;&atilde;o &eacute; um sistema para anota&ccedil;&atilde;o de um texto de modo que ele seja sintaticamente distingu&iacute;vel. Diferente das linguagens de programa&ccedil;&atilde;o, as linguagens de marca&ccedil;&atilde;o definem formatos, maneiras de exibi&ccedil;&atilde;o e padr&otilde;es dentro de um documento qualquer. As linguagens de marca&ccedil;&atilde;o s&atilde;o usadas, por exemplo, na ind&uacute;stria editorial para marcar a formata&ccedil;&atilde;o (exibi&ccedil;&atilde;o gr&aacute;fica) de p&aacute;ginas. Se o c&oacute;digo de marca&ccedil;&atilde;o for padronizado, ou puder ser processado por um programa de computador, ent&atilde;o garante-se o interc&acirc;mbio de uma publica&ccedil;&atilde;o complexa entre autores, editores e impressoras. Um exemplo famoso de linguagem de marca&ccedil;&atilde;o &eacute; o HTML (<i>HyperText Markup Language</i>), que &eacute; utilizado para produzir p&aacute;ginas na Web.
    </p>
    
    <p align=&quot;justify&quot;>
      Um documento HTML &eacute; um conjunto de <i>elementos</i>, usualmente demarcados por duas <i>tags</i>: a <i>tag inicial</i>, no formato <tt>&lt;nome-do-elemento atributo(s)&gt;</tt>, e uma <i>tag final</i>, no formato <tt>&lt;/nome-do-elemento&gt;</tt>. Um <i>atributo</i> define uma caracter&iacute;stica ou propriedade de um elemento, e, sempre que existir,  &eacute; inclu&iacute;do na tag inicial de um elemento utilizando a sintaxe <tt>nome_do_atributo=&quot;valor&quot;</tt>. Al&eacute;m disso, um elemento pode ter v&aacute;rios atributos, separados por espa&ccedil;os em branco.  O conte&uacute;do de um elemento geralmente &eacute; um texto que fica entre as tags inicial e final, e nele tamb&eacute;m podem existir outros elementos. &Eacute; garantido que n&atilde;o existem caracteres &quot;&lt;&quot; e &quot;&gt;&quot; em outras partes de um c&oacute;digo HTML que n&atilde;o sejam delimitando tags. O exemplo abaixo
&eacute; um trecho de um documento HTML: <br>

<center> <table style="font-size:13px" border="1" cellpadding="4" cellspacing="0">
  <tr>
    <td> <code>
      &lt;p&gt; Texto simples, agora &lt;b&gt;em negrito&lt;/b&gt; e agora
      &lt;i&gt;em it&aacute;lico&lt;/i&gt;.<br>
      Tamb&eacute;m pode ser &lt;b&gt;&lt;i&gt;em negrito e it&aacute;lico ao mesmo
      tempo&lt;/i&gt;&lt;/b&gt;. &lt;/p&gt;<br><br>

      &lt;p align=&quot;right&quot;&gt; Este par&aacute;grafo est&aacute; &agrave; direita! &lt;/p&gt;<br><br>

      &lt;p align=&quot;center&quot;&gt; Este par&aacute;grafo est&aacute; no centro e<br> &lt;font style=&quot;color:red&quot;&gt;este
      texto est&aacute; em vermelho&lt;/font&gt;. &lt;/p&gt;
    </code> </td>

    <td>
      <p> Texto simples, agora <b>em negrito</b> e agora <i>em it&aacute;lico</i>.
      Tamb&eacute;m pode ser <b><i>em negrito e it&aacute;lico ao mesmo tempo</i></b>. </p>

      <p align="right"> Este par&aacute;grafo est&aacute; &agrave; direita! </p>

      <p align="center"> Este par&aacute;grafo est&aacute; no centro e <font style="color:red">este texto est&aacute; em vermelho</font>. </p>
    </td>
</tr></table> </center>
</p>
    </p>
    
    <p align=&quot;justify&quot;>
      Neste laborat&oacute;rio, dado uma p&aacute;gina HTML de um usu&aacute;rio do Twitter, sua tarefa ser&aacute; extrair apenas os textos dos tweets do usu&aacute;rio.
    </p> 
    
    
    <h3>Dicas:</h3>
      
      
    <p align=&quot;justify&quot;>  
      <ul>
        <li>No c&oacute;digo HTML da p&aacute;gina do Twitter, os tweets do usu&aacute;rio est&atilde;o dentro de uma tag <tt>p</tt> cujo atributo <tt>class</tt> possui valor <tt>&quot;ProfileTweet-text js-tweet-text u-dir&quot;</tt>.</li>
        <li>Como aspas simples (&#039;) e aspas duplas (&quot;) s&atilde;o caracteres de sintaxe HTML, quando vamos utiliz&aacute;-los em um texto dentro de um arquivo HTML &eacute; adequado convert&ecirc;-los em <i>entidades</i>. Uma entidade tem como prefixo o caractere <tt>&#39;&amp;&#39;</tt> (&quot;e&quot; comercial), e como sufixo o caractere <tt>&#39;;&#39;</tt> (ponto-e-v&iacute;rgula) e, entre o prefixo e o sufixo, um identificador do caractere. Um caractere pode possuir mais de uma entidade, por&eacute;m, as entidades dos caracteres aspas simples e aspas duplas utilizadas pelo Twitter s&atilde;o, respectivamente,  <tt>&amp;#39;</tt> e <tt>&amp;quot;</tt>. Seu programa deve extrair os tweets do usu&aacute;rio convertendo estas duas entidades pelo caractere correspondente. Al&eacute;m das duas entidades citadas, outras entidades poder&atilde;o estar presentes nos tweets, e devem apenas ser ignoradas (ou seja, devem ser suprimidas no texto final).</li>
        <li>N&atilde;o se preocupe caso o tweet seja um &quot;retweet&quot;, contenha links ou imagens. Seu programa deve apenas imprimir os textos correspondentes que estiverem entre as tags.</li>
        <li>Abra os arquivos HTMLs correspondentes &agrave;s entradas abaixo num editor de texto e procure as regi&otilde;es onde est&atilde;o localizados o tweets, conforme a primeira dica acima, de forma que voc&ecirc; veja o c&oacute;digo completo de um tweet e possa compar&aacute;-lo com a sa&iacute;da esperada (veja nos exemplos abaixo). 
      </ul>
    </p>
    
    <h3>Importante:</h3>

    <ul>
      <li> Utilize o <a href="aux/lab12a.c">c&oacute;digo</a> fornecido na se&ccedil;&atilde;o &quot;Arquivos auxiliares&quot; como ponto de partida. Voc&ecirc; deve incluir o que for necess&aacute;rio para resolver este laborat&oacute;rio e n&atilde;o deve alterar nada do que j&aacute; existe nesse c&oacute;digo.</li>
      <ul>
        <li>No c&oacute;digo, al&eacute;m da fun&ccedil;&atilde;o <tt>main</tt>, &eacute; fornecida a fun&ccedil;&atilde;o <tt>converte_entidade</tt>, que descobre se uma entidade corresponde aos caracteres aspas simples ou aspas duplas, imprimindo-os diretamente no arquivo de sa&iacute;da (ignorando qualquer outra entidade). Para mais detalhes sobre esta fun&ccedil;&atilde;o, veja os coment&aacute;rios no c&oacute;digo fornecido.</li>
      </ul>
      <li> Para testar este laborat&oacute;rio, a linha de comando &eacute; a seguinte:
        <p>
        <center> <tt> ./lab12a arqXX.in arqXX.out </tt> </center> 
        </p>
        sendo <tt>arqXX.in</tt> o arquivo que cont&eacute;m o c&oacute;digo HTML de uma p&aacute;gina do Twitter (corresponde a <tt>nomearqin</tt> citado abaixo) e <tt>arqXX.out</tt> o arquivo onde os tweets ser&atilde;o escritos (corresponde a <tt>nomearqout</tt> citado abaixo) e que deve ser comparado com o arquivo <tt>arqXX.res</tt> correspondente. Note que os arquivos com extens&atilde;o &quot;<tt>.in</tt>&quot; e &quot;<tt>.res</tt>&quot; s&atilde;o os arquivos fornecidos na se&ccedil;&atilde;o &quot;Testes&quot;.</li>
      <li>Neste laborat&oacute;rio voc&ecirc; n&atilde;o deve o usar o <a href="http://www.ic.unicamp.br/~zanoni/mc102/2015-1s/testador/">Script para Aux&iacute;lio nos Testes dos Laborat&oacute;rios</a>, j&aacute; que ele n&atilde;o est&aacute; preparado para lidar com o modo de execu&ccedil;&atilde;o mencionado acima.
    </ul>

    <h3>Entrada</h3>

    <ul>
      <li>A entrada &eacute; composta por duas sequ&ecirc;ncias de caracteres <tt>nomearqin</tt> e <tt>nomearqout</tt> fornecidas na linha de comando tais que:
        <ul>
          <li> <tt>nomearqin</tt> &eacute; igual ao nome do arquivo contendo um c&oacute;digo HTML de uma p&aacute;gina do Twitter, com <tt>1 &leq; |nomearqin| &leq; 25</tt>. </li>
          <li> <tt>nomearqout</tt> &eacute; igual ao nome do arquivo em que seu programa dever&aacute; imprimir os tweets, com <tt>1 &leq; |nomearqout| &leq; 25</tt>. </li>
        </ul> </li>
    </ul>

    <h3>Sa&iacute;da</h3>
    <ul>
      <li>Seu programa deve imprimir todos os tweets encontrados na p&aacute;gina HTML, um por linha.</li>
    </ul>
    <h3>Exemplos</h3>
    <p align=&quot;justify&quot;>  
      Aten&ccedil;&atilde;o: devido o tamanho dos arquivos HTML o campo de entrada das tabelas abaixo cont&eacute;m o link para o conte&uacute;do real.
    </p>
    <table cellpadding='2' cellspacing='0' border='1'>
      <tr align='center'><td width='15px'><b><tt>#</tt></b></td><td width='80px'><b><tt>Arquivo nomearqin</tt></b></td><td width='1100px'><b><tt>Conte&uacute;do do arquivo nomearqout</tt></b></td></tr>
               <tr align='left' valign='top'><td>1</td><td><tt><a href="dados/arq01.in" target="blank">arq01.in</a></tt></td><td><tt>Check this off your bucket list. http://ofa.bo/s4MQ pic.twitter.com/0Dr0V3czMH<br>&quot;Time and time again, @SenatorReid stood up to special interests and made sure every one of his constituents had a voice.&quot; &#8212;President Obama<br>Wouldn&#39;t it be nice to fly to D.C. to meet President Obama? Here&#39;s your chance: http://ofa.bo/g4Gw<br>If you believe in this grassroots movement for change, make an investment in its future&#8212;chip in today: http://ofa.bo/q4J2<br>&quot;There&#39;s nothing we can&#39;t do if the American people decide it&#39;s time.&quot; &#8212;President Obama<br>&quot;We&#39;re also our brother&#39;s keeper ... our sister&#39;s keeper. We&#39;re also a country that believes everyone gets a fair shot.&quot; &#8212;President Obama<br>&quot;Wall Street reform, what we passed five years ago, is protecting working families and taxpayers.&quot; &#8212;President Obama<br>&quot;I want to invest in basic research so the jobs and industry of the future take root here.&quot; &#8212;President Obama<br>&quot;The deficit has come down by two-thirds since I&#39;ve been president.&quot; &#8212;President Obama<br>&quot;I want to put more people back to work&#8212;rebuilding our roads and our bridges, modern ports, faster trains, faster internet&quot; &#8212;President Obama<br>&quot;These ideas are not about ideology&#8212;the reason we proposed these ideas is because we know they work.&quot; &#8212;President Obama<br>&quot;Two years of community college should be as free and universal as high school is today.&quot; &#8212;President Obama #CollegeOpportunity<br>&quot;Thanks to the hard work of the American people, America&#39;s coming back.&quot; &#8212;President Obama<br>&quot;More than 16 million Americans have gained the security of health insurance.&quot; &#8212;President Obama #BetterWithObamacare<br>&quot;In America, if you work hard, you can get ahead.&quot; &#8212;President Obama<br>LIVE: President Obama is speaking about the economy at Lawson State Community College in Birmingham, Alabama. http://ofa.bo/f4Kq<br>Tune in at 4:10 p.m. ET to watch President Obama speak about the economy at Lawson State Community College: http://ofa.bo/r4L1<br>Add your name. Get entered to win a trip for two to D.C. Meet the President. It&#39;s that easy. http://ofa.bo/p4Oa<br>Get ready&#8212;enter for your chance to meet President Obama: http://ofa.bo/r4KO pic.twitter.com/ilxzLTtOmG<br>Read how these three women&#39;s lives and careers are #BetterWithObamacare: http://ofa.bo/r4Jx</tt></td></tr>
      <tr align='left' valign='top'><td>2</td><td><tt><a href="dados/arq02.in" target="blank">arq02.in</a></tt></td><td><tt>Since 2010, children&#8217;s and mothers&#8217; lives have been saved at the fastest rate ever:  http://b-gat.es/1xw4Klb pic.twitter.com/P7stuwjFpY<br>The new book &ldquo;Becoming Steve Jobs&rdquo; (http://b-gat.es/19NhQQn) has me thinking of my old friend. A true visionary. #TBT pic.twitter.com/SpSXXRUTLD<br>Very interesting. A new test could help us understand how malaria evolves: http://b-gat.es/19Nh6uA pic.twitter.com/p2zBdYzwuk<br>The world needs to arm itself for a different type of war&#8211;a war against germs: http://b-gat.es/1FTNAyO pic.twitter.com/eFOiuo9ipv<br>7 things we&#39;ll need to strengthen before the next epidemic: http://b-gat.es/18TyE7l pic.twitter.com/3eTpsSMTCy<br>The next epidemic could be 1,000x worse than Ebola. Here&#8217;s what I hope we do about it: http://b-gat.es/1ALLQ5A pic.twitter.com/LUhzdi4vBq<br>My favorite business book and a guide to lying with statistics. 6 books I recommend: http://b-gat.es/1Ofy4kN #TED2015 pic.twitter.com/Nuqm7LMvgq<br>This suit is hot enough in Vancouver. What would it be like treating patients in W Africa? http://b-gat.es/197GgCY pic.twitter.com/5BY1LWGFIK<br>Microbes&#8212;not missiles&#8212;are what could kill 10M people: http://b-gat.es/1EwAR0W pic.twitter.com/9dTd2MHraj<br>Getting new tools to the people fighting Ebola is harder than it needs to be: http://b-gat.es/1ALGF5A pic.twitter.com/ikkKdo9BR4<br>&quot;Failure to prepare could allow the next epidemic to be dramatically more devastating than Ebola.&rdquo; &#8212; @BillGates http://t.ted.com/N5EFpHB<br>We&#8217;re not ready for the next epidemic. Here&#8217;s what it will take: http://b-gat.es/1O9oRug pic.twitter.com/S8mrxF7Do5<br>Ebola suits make everything more difficult. Even writing a simple message like this: http://b-gat.es/1FFcty8 pic.twitter.com/jC4dpYEHh0<br>In the mock Ebola ward at #ted2015. It is amazing to me that people can get anything done in these suits. pic.twitter.com/ZneG0EGUat<br>How to take off Ebola protective equipment. At the #TED2015 Suiting Up for Ebola experience. https://vine.co/v/OVx3b6LlgOw<br>So @BillGates set up an Ebola clinic at #TED2015 and I got to pretend to be a aid worker http://recode.net/2015/03/18/inside-the-mock-ebola-hospital-bill-gates-set-up-at-ted-video/&#8230; pic.twitter.com/M6X3LpnA6i<br>The world isn&#8217;t prepared to handle a massive epidemic. But we can get there: http://b-gat.es/1DBrrpX http://b-gat.es/1bghrGE<br>Thanks for taking the time to read it, @Atul_Gawande. Your work was a real inspiration for it.<br>What did we learn from Ebola? We need to be better WHEN the next epidemic hits: http://b-gat.es/19zudiL<br>I think @WarrenBuffett&#8217;s a better investor today than ever before. Here&#8217;s why: http://b-gat.es/1FtsLdS pic.twitter.com/llDKe7hKu5</tt></td></tr>
      <tr align='left' valign='top'><td>3</td><td><tt><a href="dados/arq03.in" target="blank">arq03.in</a></tt></td><td><tt>Happy New Year ! pic.twitter.com/quJvHqWw8A<br>HAPPY ANNIVERSARY, LINUX!<br>Free Intro to Linux Online Course Starts Today http://www.linux.com/news/featured-blogs/200-libby-clark/782685-free-intro-to-linux-online-course-starts-today&#8230; via @linuxfoundation<br>Happy SysAdmin Day!<br>Linux Nears Total Domination of the Top500 Supercomputers http://www.linux.com/news/enterprise/high-performance/147-high-performance/778179--linux-nears-total-domination-of-the-top500-supercomputers&#8230; via @linuxfoundation<br>Thank you for wishing me Happy Birthday :)<br>The Top 10 Best Linux Videos of 2013 http://www.linux.com/news/featured-blogs/200-libby-clark/752470-best-linux-videos-of-2013&#8230; via @linuxfoundation<br>Linux for Workgroups Linux 3.11s feature set now confirmed  http://www.h-online.com/open/news/item/Linux-for-Workgroups-Linux-3-11-s-feature-set-now-confirmed-1917712.html/from/twitter&#8230;<br>LinuxCon Japan -Presentations http://events.linuxfoundation.org/events/linuxcon-japan/program/presentations&#8230;<br>6 Key New Features in Linux 3.9 http://www.linux.com/news/software/linux-kernel/716624-6-key-new-features-in-linux-39&#8230; via @linuxfoundation<br>8,000 developers from 800 companies have contributed to the Linux kernel http://bit.ly/Ha9sK1<br>Linux Foundation Training Prepares the International Space Station for Linux Migration  https://www.linux.com/news/featured-blogs/191-linux-training/711318-linux-foundation-training-prepares-the-international-space-station-for-linux-migration&#8230; via @linuxfoundation<br>Support #Linux and its creator Linus Torvalds by joining @linuxfoundation: http://bit.ly/Ra12D9<br>Friday Funnies http://www.linux.com/news/friday-funnies/good-old-days&#8230; via @linuxfoundation<br>&#39;The Linux kernel&#39; website updated https://www.kernel.org/<br>Sonar Project Wants to Bring Linux to Everyone http://www.linux.com/news/software/applications/701409-sonar-project-wants-to-bring-linux-to-everyone&#8230; via @linuxfoundation<br>@Linus__Torvalds well respected love the work been a supporter of open source for many years now great work<br>Divers ahoy! Lots of improvements, including much better support for  multiple dive computers, new deco calculations.<br>Intelligence is the ability to avoid doing work, yet getting the work done.</tt></td></tr>
      <tr align='left' valign='top'><td>4</td><td><tt><a href="dados/arq04.in" target="blank">arq04.in</a></tt></td><td><tt>A presidenta @dilmabr lamentou a queda do avi&atilde;o da Germanwings e apresentou seus sentimentos e votos de luto http://goo.gl/V2yCaC<br>As centrais sindicais constru&iacute;ram conosco a pol&iacute;tica de valoriza&ccedil;&atilde;o do #Sal&aacute;rioM&iacute;nimo<br>Tenho consci&ecirc;ncia da import&acirc;ncia dos parlamentares e tbm das centrais sindicais, q tiveram um papel relevante nesse Pa&iacute;s. #Sal&aacute;rioM&iacute;nimo<br>&Eacute; um momento especial e agrade&ccedil;o aos parlamentares, pq foi com a compreens&atilde;o e participa&ccedil;&atilde;o q estamos dando esse passo. #Sal&aacute;rioM&iacute;nimo<br>A valoriza&ccedil;&atilde;o do #Sal&aacute;rioM&iacute;nimo beneficia um conjunto imenso de trabalhadores, p/ q tenham acesso aos bens e condi&ccedil;&otilde;es m&iacute;nimas de vida.<br>O crescimento econ&ocirc;mico n&atilde;o se d&aacute; em detrimento do trabalhador, e n&atilde;o se dar&aacute; c/ a redu&ccedil;&atilde;o de pol&iacute;ticas sociais. #Sal&aacute;rioM&iacute;nimo<br>&Eacute; importante o Brasil continuar com a pol&iacute;tica de valoriza&ccedil;&atilde;o do #Sal&aacute;rioM&iacute;nimo.<br>Esse Pa&iacute;s tem uma economia s&oacute;lida, n&atilde;o temos nenhum desequil&iacute;brio. O Pa&iacute;s est&aacute; passando por uma dificuldade conjuntural. #Sal&aacute;rioM&iacute;nimo<br>Dilma: &Eacute; importante lembrar que nesse per&iacute;odo tivemos um reajuste em torno de 70%. #Sal&aacute;rioM&iacute;nimo<br>&quot;Temos uma situa&ccedil;&atilde;o de sistem&aacute;tico reajuste e valoriza&ccedil;&atilde;o do #sal&aacute;riom&iacute;nimo&quot;, afirma @dilmabr. Acompanhe na @TVNBR: http://conteudo.ebcservicos.com.br/streaming/nbr<br>Essa pol&iacute;tica, que representou um ganho real do sal&aacute;rio dos trabalhadores mais pobres desse Pa&iacute;s, passa a ser realidade. #Sal&aacute;rioM&iacute;nimo<br>Agora, enviamos outro projeto, para o per&iacute;odo de 2015 a 2019. #Sal&aacute;rioM&iacute;nimo<br>Em 2011, enviamos projeto que ia de 2011 a 2015, englobando este ano. #Sal&aacute;rioM&iacute;nimo<br>A pol&iacute;tica nacional de valoriza&ccedil;&atilde;o do #Sal&aacute;rioM&iacute;nimo foi implantada pelo governo Lula e vigia ano a ano.<br>#AoVivo Presidenta @dilmabr assina Medida Provis&oacute;ria da Pol&iacute;tica do #Sal&aacute;rioM&iacute;nimo: http://goo.gl/kMjifR<br>A assessoria tuita agora trechos do discurso da presidenta durante assinatura da MP da Pol&iacute;tica Nacional do #Sal&aacute;rioM&iacute;nimo<br>Confira no v&iacute;deo do @minesporte o detalhamento das a&ccedil;&otilde;es que est&atilde;o em andamento, em diversas &aacute;reas: http://goo.gl/lYKr5U #Faltam500dias<br>#Faltam500dias p/ os Jogos @Rio2016 e o Brasil est&aacute; em est&aacute;gio avan&ccedil;ado de prepara&ccedil;&atilde;o. Sem d&uacute;vida ser&aacute; um grande evento e uma bela festa!<br>Dilma participou da abertura da colheita de arroz ecol&oacute;gico e inaugurou unidade de armazenagem e secagem da COOTAP. pic.twitter.com/YaTQajBFil<br>&Eacute; importante provar q &eacute; poss&iacute;vel, sim, ter desenvolvimento sustent&aacute;vel, de alta qualidade, baseado em assentamento da reforma agr&aacute;ria.</tt></td></tr>
      <tr align='left' valign='top'><td>5</td><td><tt><a href="dados/arq05.in" target="blank">arq05.in</a></tt></td><td><tt>Boa noite a todos.<br>#VestibularFatec O prazo para isen&ccedil;&atilde;o ou redu&ccedil;&atilde;o de 50% da taxa de inscri&ccedil;&atilde;o do Vestibular da Fatec &eacute; at&eacute; 07/04 http://bit.ly/1E00fhK<br>Acreditar e investir nos jovens, na inova&ccedil;&atilde;o e no conhecimento cient&iacute;fico &eacute; uma grande alavanca para o desenvolvimento social e econ&ocirc;mico.<br>A edi&ccedil;&atilde;o do ano passado foi um sucesso. Al&eacute;m de trabalhos das Etecs e Fatecs, a feira contou com projetos de outros estados e pa&iacute;ses.<br>A 9&ordf; Feira Tecnol&oacute;gica do @paulasouzasp ser&aacute; em outubro. As inscri&ccedil;&otilde;es est&atilde;o abertas at&eacute; 15/05 http://bit.ly/19nWlVd pic.twitter.com/0u8ft0GN6g<br>Comentei tamb&eacute;m os avan&ccedil;os das obras do metr&ocirc;, nossos projetos em habita&ccedil;&atilde;o e a melhora nos &iacute;ndices de criminalidade que divulgamos ontem.<br>Falei sobre abastecimento de &aacute;gua, economia, combate &agrave; dengue, educa&ccedil;&atilde;o e o b&ocirc;nus que estamos pagando aos professores.<br>Foi um prazer conversar hoje pela manh&atilde; com o Eli Correa e seus ouvintes da R&aacute;dio @capital1040 http://bit.ly/1CS9x0C pic.twitter.com/1nEnhNtj0e<br>Vamos trabalhar para que o Senado tamb&eacute;m aprove rapidamente esta lei pic.twitter.com/Zmo3rXG5Ao<br>Esta lei adota a linha da proposta que enviamos, transformando o homic&iacute;dio de policiais em homic&iacute;dio qualificado, com pena superior ao comum<br>Hoje a C&acirc;mara de Deputados aprovou um importante projeto que torna mais r&iacute;gidas as penas p/crimes contra policiais e agentes de seg p&uacute;blica.<br>Boa noite a todos.<br>Fui surpreendido pelo mascote do grupamento &Aacute;guia de Campinas, que me recepcionou com uma mensagem de boas vindas pic.twitter.com/84qeBInxmx<br>Tamb&eacute;m tivemos uma queda de quase 40% nos casos de latroc&iacute;nio e de mais de 27% nos de roubo de ve&iacute;culos comparando fevereiro de 2015 e 2104<br>Tivemos o menor n&uacute;mero de furtos desde 2002 para o m&ecirc;s de fevereiro http://bit.ly/1N9wvn5<br>Mais uma &oacute;tima not&iacute;cia p/ a seguran&ccedil;a: todos os &iacute;ndices criminais sofreram queda no 1&ordm; bimestre de 2015 em rela&ccedil;&atilde;o ao mesmo per&iacute;odo de 2014.<br>Na sexta, a equipe do helic&oacute;ptero &Aacute;guia 10 ajudou uma jovem a chegar a tempo p/uma cirurgia de transplante de f&iacute;gado http://bit.ly/1BIHGdU<br>Isso permite que 85% da popula&ccedil;&atilde;o do Estado esteja ao alcance de um dos nossos helic&oacute;pteros em no m&aacute;ximo 20 minutos.<br>SP tem a maior organiza&ccedil;&atilde;o de policiamento a&eacute;reo da Am&eacute;rica Latina e do hemisf&eacute;rio sul e uma das maiores do mundo.<br>Em uma situa&ccedil;&atilde;o de emerg&ecirc;ncia, a rapidez na a&ccedil;&atilde;o e o preparo dos profissionais fazem toda a diferen&ccedil;a pic.twitter.com/Mki4hCBIk1</tt></td></tr>
    </table><br>
</body></html>
